app/views/collections/_form.html.haml

        -# не реализовано через showrooms_ids, поскольку тогда происходит конфликт со значениями
        = f.collection_select(:showroom_ids, Showroom.all, :id, :roomname, {include_hidden: false}, {multiple: true,:size => Showroom.all.length, class: 'form-control'})
---
SELECT  "collections".* FROM "collections"  ORDER BY "collections"."id" ASC LIMIT 1
SELECT "showrooms".* FROM "showrooms" INNER JOIN "collections_showrooms" ON "showrooms"."id" = "collections_showrooms"."showroom_id" WHERE "collections_showrooms"."collection_id" = $1  [["collection_id", 3]]