app/views/collections/show.html.haml

  %dt= Collection.human_attribute_name(:showrooms)
  %dd= @collection.showrooms.map{ |a| a.roomname }.join(', ')
---
SELECT "showrooms".* FROM "showrooms" INNER JOIN "collections_showrooms" ON "showrooms"."id" = "collections_showrooms"."showroom_id" WHERE "collections_showrooms"."collection_id" = $1  [["collection_id", 10]]