app/views/exhibits/_form.html.haml

      = f.label :collection
      = f.select :collection_id, Collection.all.map{|x| [x.colname, x.id]}, {}, {class: 'form-control'}
---
SELECT "collections".* FROM "collections"