app/views/users/show.html.haml

SELECT  "roles".* FROM "roles" WHERE "roles"."id" = $1 LIMIT 1  [["id", 2]]
SELECT "role_users".* FROM "role_users" WHERE "role_users"."user_id" = $1  [["user_id", 2]]
---
  %dt= User.human_attribute_name(:role_users)
  %dd= @user.role_users.map{ |ru| ru.role.name }.uniq.join(', ')