app/controllers/collections_controller.rb

  def index
    @collections = Collection.all
---
SELECT "collections".* FROM "collections"

  def new
    @collection = Collection.new
    @showroom = Showroom.all
---
SELECT "showrooms".* FROM "showrooms"

  def edit
	@showroom = Showroom.all
---
SELECT "showrooms".* FROM "showrooms"

  def create
    @collection = Collection.new(collection_params)
	@showrooms = []
	params[:collection][:showrooms].each{|a| @showrooms << Showroom.find(a) if a.present?}
    respond_to do |format|
      if @collection.save
		@showrooms.each{|a| a.collections << @collection}
---
INSERT INTO "collections" ("colname", "shdescription", "begindate", "enddate", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["colname", "2"], ["shdescription", "1"], ["begindate", "2017-04-23"], ["enddate", "2017-04-23"], ["created_at", "2017-04-23 19:06:06.401561"], ["updated_at", "2017-04-23 19:06:06.401561"]]
SELECT  "showrooms".* FROM "showrooms" WHERE "showrooms"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "collections".* FROM "collections"
SELECT "showrooms".* FROM "showrooms"

  def update
	@showrooms = []
	params[:collection][:showrooms].each{|a| @showrooms << Showroom.find(a) if a.present?}
    respond_to do |format|
      if @collection.update(collection_params)
<<<<<<< HEAD
		@showrooms.each{|a| a.collections << @collection if !(a.collections.include?(@collection))}
---
SELECT  "collections".* FROM "collections" WHERE "collections"."id" = $1 LIMIT 1  [["id", 2]]
SELECT  "showrooms".* FROM "showrooms" WHERE "showrooms"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "collections" SET "colname" = $1, "shdescription" = $2, "updated_at" = $3 WHERE "collections"."id" = $4  [["colname", " "], ["shdescription", " "], ["updated_at", "2017-04-17 12:55:43.326799"], ["id", 1]]
SELECT "showrooms".* FROM "showrooms" INNER JOIN "collections_showrooms" ON "showrooms"."id" = "collections_showrooms"."showroom_id" WHERE "collections_showrooms"."collection_id" = $1  [["collection_id", 3]]

  def destroy
    @collection.destroy
---
DELETE FROM "collections" WHERE "collections"."id" = $1  [["id", 1]]

    def set_collection
      @collection = Collection.find(params[:id])
---
SELECT  "collections".* FROM "collections" WHERE "collections"."id" = $1 LIMIT 1  [["id", 2]]