app/controllers/exhibits_controller.rb

SELECT "exhibits".* FROM "exhibits"
---
  def index
    @exhibits = Exhibit.all

INSERT INTO "exhibits" ("name", "sdescription", "insurance", "century", "height", "width", "length", "tempcontrol", "himiditycontrol", "peopleprotect", "collection_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13) RETURNING "id"
---
  def create
    @exhibit = Exhibit.new(exhibit_params)
    respond_to do |format|
      if @exhibit.save

UPDATE "exhibits" SET "name" = $1, "sdescription" = $2, "insurance" = $3, "century" = $4, "height" = $5, "width" = $6, "length" = $7, "updated_at" = $8 WHERE "exhibits"."id" = $9  [["name", "1"], ["sdescription", "4"], ["insurance", 5], ["century", 5], ["height", 9], ["width", 1], ["length", 2], ["updated_at", "2017-04-17 14:34:26.727689"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @exhibit.update(exhibit_params)

SELECT  "exhibits".* FROM "exhibits" WHERE "exhibits"."id" = $1 LIMIT 1  [["id", 1]]
---
    def set_exhibit
      @exhibit = Exhibit.find(params[:id])