app/controllers/roles_controller.rb

    def set_role
      @role = Role.find(params[:id])
---
SELECT  "roles".* FROM "roles" WHERE "roles"."id" = $1 LIMIT 1  [["id", 1]]