app/controllers/showrooms_controller.rb

SELECT "showrooms".* FROM "showrooms"
---
  def index
    @showrooms = Showroom.all

INSERT INTO "showrooms" ("roomname", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["roomname", "Зал динозавров"], ["created_at", "2017-04-23 20:01:30.701104"], ["updated_at", "2017-04-23 20:01:30.701104"]]
---
  def create
    @showroom = Showroom.new(showroom_params)

    respond_to do |format|
      if @showroom.save

SELECT  "showrooms".* FROM "showrooms" WHERE "showrooms"."id" = $1 LIMIT 1  [["id", 3]]
---
    def set_showroom
      @showroom = Showroom.find(params[:id])