app/controllers/users_controller.rb

SELECT  "role_users".* FROM "role_users" WHERE "role_users"."user_id" = $1  ORDER BY "role_users"."id" ASC LIMIT 1  [["user_id", 1]]
SELECT "users".* FROM "users"
---
  def index
    @users = User.all

INSERT INTO "users" ("email", "salt", "crypted_password", "created_at", "updated_at", "activation_token", "activation_state") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "role_users".* FROM "role_users" WHERE "role_users"."user_id" = $1  [["user_id", 2]]
---
    def set_user
      @user = User.find(params[:id])